#pragma once

#include "vivid.h"

///============================================================
/// ゲーム全体を統括するマネージャクラス
/// ・シーン管理（SceneManager）やゲーム全体の更新／描画／初期化／解放を管理
/// ・シングルトン設計で1つだけ存在
///============================================================
class CGameManager
{
public:
	//========================================================
	// シングルトン取得
	//========================================================
	static CGameManager& GetInstance(void);

	//========================================================
	// 初期化
	// ・ゲーム全体の初期化処理
	// ・SceneManager の初期化も含む
	//========================================================
	void Initialize(void);

	//========================================================
	// 更新
	// ・ゲーム全体の更新処理
	// ・SceneManager の更新も行う
	//========================================================
	void Update(void);

	//========================================================
	// 描画
	// ・ゲーム全体の描画処理
	// ・SceneManager の描画およびエフェクト描画を実行
	//========================================================
	void Draw(void);

	//========================================================
	// 終了処理
	// ・ゲーム全体の終了処理
	// ・SceneManager の解放を含む
	//========================================================
	void Finalize(void);

private:
	//========================================================
	// コンストラクタ / デストラクタ
	// シングルトン設計のためコピー禁止
	//========================================================
	CGameManager(void) = default;
	CGameManager(const CGameManager& rhs) = delete;
	~CGameManager(void) = default;
	CGameManager operator=(const CGameManager& rhs) = delete;
};
