#pragma once

#include "vivid.h"
#include "../character.h"

//------------------------------------------------------------
// プレイヤークラス
// ・ICharacter を継承した操作キャラクター
// ・生存／死亡状態の処理を持つ
//------------------------------------------------------------
class CPlayer
	: public ICharacter
{
public:
	//--------------------------------------------------------
	// コンストラクタ
	//--------------------------------------------------------
	CPlayer(void);

	//--------------------------------------------------------
	// デストラクタ
	//--------------------------------------------------------
	~CPlayer(void);

	//--------------------------------------------------------
	// 初期化処理
	//--------------------------------------------------------
	// position : （未使用）固定の開始位置を使用
	//--------------------------------------------------------
	void Initialize(const vivid::Vector2& position) override;

	//--------------------------------------------------------
	// 更新処理
	//--------------------------------------------------------
	void Update(void) override;

	//--------------------------------------------------------
	// 描画処理
	//--------------------------------------------------------
	void Draw(void) override;

	//--------------------------------------------------------
	// 解放処理
	//--------------------------------------------------------
	void Finalize(void) override;

private:
	//--------------------------------------------------------
	// 生存状態処理
	//--------------------------------------------------------
	void Alive(void) override;

	//--------------------------------------------------------
	// 死亡状態処理
	//--------------------------------------------------------
	void Dead(void) override;

	//--------------------------------------------------------
	// 定数パラメータ
	//--------------------------------------------------------
	static const int   m_width;           // プレイヤーの横幅
	static const int   m_height;          // プレイヤーの高さ
	static const int   m_max_life;        // 最大ライフ
	static const float m_radius;          // 円判定用半径
	static const vivid::Vector2 m_start_position; // 開始位置
	static const std::string m_player_texture_path;	// プレイヤーの絵のファイルパス
	static const std::string m_invincible_player_texture_path;	// 無敵状態のプレイヤーの絵のファイルパス
	static const std::string m_jump_gauge_texture_path;	// ジャンプ力上昇中の絵のファイルパス
	static const std::string m_revese_player_texture_path; // 重力が逆の状態の絵のファイルパス
	static const std::string m_revese_jump_gauge_texture_path; // 重力が逆の状態のジャンプ力上昇中の絵のファイルパス
	static const std::string m_revese_invincible_player_texture_path; // 重力が逆の状態で無敵状態の絵のファイルパス

};
