#pragma once

#include "vivid.h"
#include "../bullet.h"

//------------------------------------------------------------
// 通常弾クラス
// ・IBullet を継承した基本的な弾
// ・サイズと描画のみを定義する
//------------------------------------------------------------
class CNormalBullet
	: public IBullet
{
public:
	//--------------------------------------------------------
	// コンストラクタ
	//--------------------------------------------------------
	CNormalBullet(void);

	//--------------------------------------------------------
	// デストラクタ
	//--------------------------------------------------------
	~CNormalBullet(void) = default;

	//--------------------------------------------------------
	// 描画処理
	//--------------------------------------------------------
	void Draw(void) override;

private:
	//--------------------------------------------------------
	// 当たり判定・描画サイズ定義
	//--------------------------------------------------------
	static const int   m_width;   // 弾の横幅
	static const int   m_height;  // 弾の高さ
	static const float m_radius;  // 円判定用半径
};
